{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "lambda", "class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxwAAAB8AGQAZACFAmQAZAGFAmYCGQBkAhQAZAEXAFMAKQNO\n6QEAAADpAAAAAKkAKQHaAXhyAwAAAHIDAAAA+g9zdHlsZWdhbl90d28ucHnaCDxsYW1iZGE+6gAA\nAPMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 1536, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"name": "reshape", "class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [4, 4, 96]}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"name": "activation", "class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "linear"}, "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 1], "dtype": "float32", "sparse": false, "name": "input_9"}, "inbound_nodes": []}, {"name": "dense_7", "class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+g9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9f\nZml0QQAAAHMGAAAAAAIOAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["input_9", 0, 0, {}], ["activation", 0, 0, {}]]]}, {"name": "conv2d_mod", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod", "trainable": true, "dtype": "float32", "filters": 768, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "inbound_nodes": [[["activation", 0, 0, {}], ["dense_7", 0, 0, {}]]]}, {"name": "dense_8", "class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_mod", 0, 0, {}], ["dense_8", 0, 0, {}]]]}, {"name": "leaky_re_lu_18", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_18", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "dense_9", "class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "conv2d_mod_1", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_1", "trainable": true, "dtype": "float32", "filters": 768, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "inbound_nodes": [[["leaky_re_lu_18", 0, 0, {}], ["dense_9", 0, 0, {}]]]}, {"name": "dense_10", "class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_mod_1", 0, 0, {}], ["dense_10", 0, 0, {}]]]}, {"name": "leaky_re_lu_19", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_19", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcxQAAAB0AGoBfABkAWQBZAJkA2QEjQVTACkFTukCAAAA2g1j\naGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9uKQLaAUvaDXJlc2l6ZV9pbWFn\nZXMpAdoBeKkAcggAAAD6D3N0eWxlZ2FuX3R3by5wedoIdXBzYW1wbGVIAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 8, 8, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}]]]}, {"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "dense_12", "class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+g9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9f\nZml0QQAAAHMGAAAAAAIOAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["input_9", 0, 0, {}], ["lambda_3", 0, 0, {}]]]}, {"name": "conv2d_mod_3", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_3", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "inbound_nodes": [[["lambda_3", 0, 0, {}], ["dense_12", 0, 0, {}]]]}, {"name": "dense_13", "class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_mod_3", 0, 0, {}], ["dense_13", 0, 0, {}]]]}, {"name": "leaky_re_lu_20", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_20", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "dense_14", "class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "conv2d_mod_4", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_4", "trainable": true, "dtype": "float32", "filters": 384, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "inbound_nodes": [[["leaky_re_lu_20", 0, 0, {}], ["dense_14", 0, 0, {}]]]}, {"name": "dense_15", "class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"name": "add_10", "class_name": "Add", "config": {"name": "add_10", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_mod_4", 0, 0, {}], ["dense_15", 0, 0, {}]]]}, {"name": "leaky_re_lu_21", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_21", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"name": "lambda_6", "class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcxQAAAB0AGoBfABkAWQBZAJkA2QEjQVTACkFTukCAAAA2g1j\naGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9uKQLaAUvaDXJlc2l6ZV9pbWFn\nZXMpAdoBeKkAcggAAAD6D3N0eWxlZ2FuX3R3by5wedoIdXBzYW1wbGVIAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 16, 16, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}]]]}, {"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "dense_17", "class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "lambda_7", "class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+g9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9f\nZml0QQAAAHMGAAAAAAIOAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["input_9", 0, 0, {}], ["lambda_6", 0, 0, {}]]]}, {"name": "conv2d_mod_6", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_6", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "inbound_nodes": [[["lambda_6", 0, 0, {}], ["dense_17", 0, 0, {}]]]}, {"name": "dense_18", "class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_7", 0, 0, {}]]]}, {"name": "add_11", "class_name": "Add", "config": {"name": "add_11", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_mod_6", 0, 0, {}], ["dense_18", 0, 0, {}]]]}, {"name": "leaky_re_lu_22", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_22", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"name": "dense_19", "class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "conv2d_mod_7", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_7", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "inbound_nodes": [[["leaky_re_lu_22", 0, 0, {}], ["dense_19", 0, 0, {}]]]}, {"name": "dense_20", "class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_7", 0, 0, {}]]]}, {"name": "add_12", "class_name": "Add", "config": {"name": "add_12", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_mod_7", 0, 0, {}], ["dense_20", 0, 0, {}]]]}, {"name": "leaky_re_lu_23", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_23", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"name": "lambda_9", "class_name": "Lambda", "config": {"name": "lambda_9", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcxQAAAB0AGoBfABkAWQBZAJkA2QEjQVTACkFTukCAAAA2g1j\naGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9uKQLaAUvaDXJlc2l6ZV9pbWFn\nZXMpAdoBeKkAcggAAAD6D3N0eWxlZ2FuX3R3by5wedoIdXBzYW1wbGVIAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 32, 32, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}]]]}, {"name": "input_5", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "name": "input_5"}, "inbound_nodes": []}, {"name": "dense_22", "class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "lambda_10", "class_name": "Lambda", "config": {"name": "lambda_10", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+g9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9f\nZml0QQAAAHMGAAAAAAIOAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["input_9", 0, 0, {}], ["lambda_9", 0, 0, {}]]]}, {"name": "conv2d_mod_9", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_9", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "inbound_nodes": [[["lambda_9", 0, 0, {}], ["dense_22", 0, 0, {}]]]}, {"name": "dense_23", "class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "dtype": "float32", "units": 144, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_10", 0, 0, {}]]]}, {"name": "add_13", "class_name": "Add", "config": {"name": "add_13", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_mod_9", 0, 0, {}], ["dense_23", 0, 0, {}]]]}, {"name": "leaky_re_lu_24", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_24", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["add_13", 0, 0, {}]]]}, {"name": "dense_24", "class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": "float32", "units": 144, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "conv2d_mod_10", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_10", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "inbound_nodes": [[["leaky_re_lu_24", 0, 0, {}], ["dense_24", 0, 0, {}]]]}, {"name": "dense_25", "class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 144, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_10", 0, 0, {}]]]}, {"name": "add_14", "class_name": "Add", "config": {"name": "add_14", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_mod_10", 0, 0, {}], ["dense_25", 0, 0, {}]]]}, {"name": "leaky_re_lu_25", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_25", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["add_14", 0, 0, {}]]]}, {"name": "lambda_12", "class_name": "Lambda", "config": {"name": "lambda_12", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcxQAAAB0AGoBfABkAWQBZAJkA2QEjQVTACkFTukCAAAA2g1j\naGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9uKQLaAUvaDXJlc2l6ZV9pbWFn\nZXMpAdoBeKkAcggAAAD6D3N0eWxlZ2FuX3R3by5wedoIdXBzYW1wbGVIAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 64, 64, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["leaky_re_lu_25", 0, 0, {}]]]}, {"name": "input_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "name": "input_6"}, "inbound_nodes": []}, {"name": "dense_27", "class_name": "Dense", "config": {"name": "dense_27", "trainable": true, "dtype": "float32", "units": 144, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "lambda_13", "class_name": "Lambda", "config": {"name": "lambda_13", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+g9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9f\nZml0QQAAAHMGAAAAAAIOAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["input_9", 0, 0, {}], ["lambda_12", 0, 0, {}]]]}, {"name": "conv2d_mod_12", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_12", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "inbound_nodes": [[["lambda_12", 0, 0, {}], ["dense_27", 0, 0, {}]]]}, {"name": "dense_28", "class_name": "Dense", "config": {"name": "dense_28", "trainable": true, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_13", 0, 0, {}]]]}, {"name": "add_15", "class_name": "Add", "config": {"name": "add_15", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_mod_12", 0, 0, {}], ["dense_28", 0, 0, {}]]]}, {"name": "leaky_re_lu_26", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_26", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["add_15", 0, 0, {}]]]}, {"name": "dense_29", "class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "conv2d_mod_13", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_13", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "inbound_nodes": [[["leaky_re_lu_26", 0, 0, {}], ["dense_29", 0, 0, {}]]]}, {"name": "dense_30", "class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_13", 0, 0, {}]]]}, {"name": "add_16", "class_name": "Add", "config": {"name": "add_16", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_mod_13", 0, 0, {}], ["dense_30", 0, 0, {}]]]}, {"name": "leaky_re_lu_27", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_27", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["add_16", 0, 0, {}]]]}, {"name": "lambda_15", "class_name": "Lambda", "config": {"name": "lambda_15", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcxQAAAB0AGoBfABkAWQBZAJkA2QEjQVTACkFTukCAAAA2g1j\naGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9uKQLaAUvaDXJlc2l6ZV9pbWFn\nZXMpAdoBeKkAcggAAAD6D3N0eWxlZ2FuX3R3by5wedoIdXBzYW1wbGVIAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 128, 128, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["leaky_re_lu_27", 0, 0, {}]]]}, {"name": "input_7", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "name": "input_7"}, "inbound_nodes": []}, {"name": "dense_32", "class_name": "Dense", "config": {"name": "dense_32", "trainable": true, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "lambda_16", "class_name": "Lambda", "config": {"name": "lambda_16", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+g9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9f\nZml0QQAAAHMGAAAAAAIOAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["input_9", 0, 0, {}], ["lambda_15", 0, 0, {}]]]}, {"name": "conv2d_mod_15", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_15", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "inbound_nodes": [[["lambda_15", 0, 0, {}], ["dense_32", 0, 0, {}]]]}, {"name": "dense_33", "class_name": "Dense", "config": {"name": "dense_33", "trainable": true, "dtype": "float32", "units": 48, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_16", 0, 0, {}]]]}, {"name": "add_17", "class_name": "Add", "config": {"name": "add_17", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_mod_15", 0, 0, {}], ["dense_33", 0, 0, {}]]]}, {"name": "leaky_re_lu_28", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_28", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["add_17", 0, 0, {}]]]}, {"name": "dense_34", "class_name": "Dense", "config": {"name": "dense_34", "trainable": true, "dtype": "float32", "units": 48, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "conv2d_mod_16", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_16", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "inbound_nodes": [[["leaky_re_lu_28", 0, 0, {}], ["dense_34", 0, 0, {}]]]}, {"name": "dense_35", "class_name": "Dense", "config": {"name": "dense_35", "trainable": true, "dtype": "float32", "units": 48, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_16", 0, 0, {}]]]}, {"name": "add_18", "class_name": "Add", "config": {"name": "add_18", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_mod_16", 0, 0, {}], ["dense_35", 0, 0, {}]]]}, {"name": "leaky_re_lu_29", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_29", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["add_18", 0, 0, {}]]]}, {"name": "lambda_18", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcxQAAAB0AGoBfABkAWQBZAJkA2QEjQVTACkFTukCAAAA2g1j\naGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9uKQLaAUvaDXJlc2l6ZV9pbWFn\nZXMpAdoBeKkAcggAAAD6D3N0eWxlZ2FuX3R3by5wedoIdXBzYW1wbGVIAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 256, 256, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["leaky_re_lu_29", 0, 0, {}]]]}, {"name": "input_8", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "name": "input_8"}, "inbound_nodes": []}, {"name": "dense_37", "class_name": "Dense", "config": {"name": "dense_37", "trainable": true, "dtype": "float32", "units": 48, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "lambda_19", "class_name": "Lambda", "config": {"name": "lambda_19", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAwAAAAYAAABDAAAAc0AAAAB8AGQBGQBqAGQBGQB9AXwAZAEZAGoAZAIZAH0CfABk\nAxkAZABkAIUCZAB8AYUCZAB8AoUCZABkAIUCZgQZAFMAKQRO6QEAAADpAgAAAOkAAAAAKQHaBXNo\nYXBlKQPaAXjaBmhlaWdodNoFd2lkdGipAHIIAAAA+g9zdHlsZWdhbl90d28ucHnaC2Nyb3BfdG9f\nZml0QQAAAHMGAAAAAAIOAQ4C\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["input_9", 0, 0, {}], ["lambda_18", 0, 0, {}]]]}, {"name": "conv2d_mod_18", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_18", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "inbound_nodes": [[["lambda_18", 0, 0, {}], ["dense_37", 0, 0, {}]]]}, {"name": "dense_38", "class_name": "Dense", "config": {"name": "dense_38", "trainable": true, "dtype": "float32", "units": 24, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_19", 0, 0, {}]]]}, {"name": "add_19", "class_name": "Add", "config": {"name": "add_19", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_mod_18", 0, 0, {}], ["dense_38", 0, 0, {}]]]}, {"name": "leaky_re_lu_30", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_30", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["add_19", 0, 0, {}]]]}, {"name": "dense_39", "class_name": "Dense", "config": {"name": "dense_39", "trainable": true, "dtype": "float32", "units": 24, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "conv2d_mod_19", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_19", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": true}, "inbound_nodes": [[["leaky_re_lu_30", 0, 0, {}], ["dense_39", 0, 0, {}]]]}, {"name": "dense_40", "class_name": "Dense", "config": {"name": "dense_40", "trainable": true, "dtype": "float32", "units": 24, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_19", 0, 0, {}]]]}, {"name": "add_20", "class_name": "Add", "config": {"name": "add_20", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2d_mod_19", 0, 0, {}], ["dense_40", 0, 0, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 768, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 50.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "dense_11", "class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 25.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "dense_16", "class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 12.5, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "dense_21", "class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 144, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 6.25, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "dense_26", "class_name": "Dense", "config": {"name": "dense_26", "trainable": true, "dtype": "float32", "units": 96, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 3.125, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "dense_31", "class_name": "Dense", "config": {"name": "dense_31", "trainable": true, "dtype": "float32", "units": 48, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.5625, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"name": "leaky_re_lu_31", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_31", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["add_20", 0, 0, {}]]]}, {"name": "dense_36", "class_name": "Dense", "config": {"name": "dense_36", "trainable": true, "dtype": "float32", "units": 24, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 0.78125, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "conv2d_mod_2", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_2", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 50.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "inbound_nodes": [[["leaky_re_lu_19", 0, 0, {}], ["dense_6", 0, 0, {}]]]}, {"name": "conv2d_mod_5", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_5", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 25.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "inbound_nodes": [[["leaky_re_lu_21", 0, 0, {}], ["dense_11", 0, 0, {}]]]}, {"name": "conv2d_mod_8", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_8", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 12.5, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "inbound_nodes": [[["leaky_re_lu_23", 0, 0, {}], ["dense_16", 0, 0, {}]]]}, {"name": "conv2d_mod_11", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_11", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 6.25, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "inbound_nodes": [[["leaky_re_lu_25", 0, 0, {}], ["dense_21", 0, 0, {}]]]}, {"name": "conv2d_mod_14", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_14", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 3.125, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "inbound_nodes": [[["leaky_re_lu_27", 0, 0, {}], ["dense_26", 0, 0, {}]]]}, {"name": "conv2d_mod_17", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_17", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.5625, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "inbound_nodes": [[["leaky_re_lu_29", 0, 0, {}], ["dense_31", 0, 0, {}]]]}, {"name": "conv2d_mod_20", "class_name": "Conv2DMod", "config": {"name": "conv2d_mod_20", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 0.78125, "mode": "fan_in", "distribution": "truncated_normal", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "demod": false}, "inbound_nodes": [[["leaky_re_lu_31", 0, 0, {}], ["dense_36", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcyYAAAB0AHwAagFkARkAGwB9AXQCagN8AHwBfAFkAmQDZASN\nBX0AfABTACkFTukCAAAA2g1jaGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9u\nKQTaB2ltX3NpemXaBXNoYXBl2gFL2g1yZXNpemVfaW1hZ2VzKQLaAXjaAXmpAHILAAAA+g9zdHls\nZWdhbl90d28ucHnaEHVwc2FtcGxlX3RvX3NpemVLAAAAcwYAAAAAAQ4BFAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 256, 256, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["conv2d_mod_2", 0, 0, {}]]]}, {"name": "lambda_5", "class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcyYAAAB0AHwAagFkARkAGwB9AXQCagN8AHwBfAFkAmQDZASN\nBX0AfABTACkFTukCAAAA2g1jaGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9u\nKQTaB2ltX3NpemXaBXNoYXBl2gFL2g1yZXNpemVfaW1hZ2VzKQLaAXjaAXmpAHILAAAA+g9zdHls\nZWdhbl90d28ucHnaEHVwc2FtcGxlX3RvX3NpemVLAAAAcwYAAAAAAQ4BFAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 256, 256, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["conv2d_mod_5", 0, 0, {}]]]}, {"name": "lambda_8", "class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcyYAAAB0AHwAagFkARkAGwB9AXQCagN8AHwBfAFkAmQDZASN\nBX0AfABTACkFTukCAAAA2g1jaGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9u\nKQTaB2ltX3NpemXaBXNoYXBl2gFL2g1yZXNpemVfaW1hZ2VzKQLaAXjaAXmpAHILAAAA+g9zdHls\nZWdhbl90d28ucHnaEHVwc2FtcGxlX3RvX3NpemVLAAAAcwYAAAAAAQ4BFAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 256, 256, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["conv2d_mod_8", 0, 0, {}]]]}, {"name": "lambda_11", "class_name": "Lambda", "config": {"name": "lambda_11", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcyYAAAB0AHwAagFkARkAGwB9AXQCagN8AHwBfAFkAmQDZASN\nBX0AfABTACkFTukCAAAA2g1jaGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9u\nKQTaB2ltX3NpemXaBXNoYXBl2gFL2g1yZXNpemVfaW1hZ2VzKQLaAXjaAXmpAHILAAAA+g9zdHls\nZWdhbl90d28ucHnaEHVwc2FtcGxlX3RvX3NpemVLAAAAcwYAAAAAAQ4BFAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 256, 256, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["conv2d_mod_11", 0, 0, {}]]]}, {"name": "lambda_14", "class_name": "Lambda", "config": {"name": "lambda_14", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcyYAAAB0AHwAagFkARkAGwB9AXQCagN8AHwBfAFkAmQDZASN\nBX0AfABTACkFTukCAAAA2g1jaGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9u\nKQTaB2ltX3NpemXaBXNoYXBl2gFL2g1yZXNpemVfaW1hZ2VzKQLaAXjaAXmpAHILAAAA+g9zdHls\nZWdhbl90d28ucHnaEHVwc2FtcGxlX3RvX3NpemVLAAAAcwYAAAAAAQ4BFAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 256, 256, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["conv2d_mod_14", 0, 0, {}]]]}, {"name": "lambda_17", "class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcyYAAAB0AHwAagFkARkAGwB9AXQCagN8AHwBfAFkAmQDZASN\nBX0AfABTACkFTukCAAAA2g1jaGFubmVsc19sYXN02ghiaWxpbmVhcikB2g1pbnRlcnBvbGF0aW9u\nKQTaB2ltX3NpemXaBXNoYXBl2gFL2g1yZXNpemVfaW1hZ2VzKQLaAXjaAXmpAHILAAAA+g9zdHls\nZWdhbl90d28ucHnaEHVwc2FtcGxlX3RvX3NpemVLAAAAcwYAAAAAAQ4BFAE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 256, 256, null], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["conv2d_mod_17", 0, 0, {}]]]}, {"name": "lambda_20", "class_name": "Lambda", "config": 